Repository: F-i-f/ssh-search-provider
Catalog: po/*.po
Languages: fr, nl, ru_ru

source: SSH Search Provider Reborn
fr: Recherche de connections SSH renée
nl: SSH-zoekdienst
ru_ru: Возрожденный поиск провайдеров SSH

source: Version
nl: Versie
ru_ru: Версия

source: Terminal Application:
fr: Émulateur de terminal :
nl: Terminaltoepassing:
ru_ru: Приложение терминала:

source: Arguments:
nl: Opdrachtregelopties:
ru_ru: Аргументы:

source: Pass SSH command line as a single argument:
fr: Passer la ligne de commande SSH en un unique argument :
nl: SSH-opdrachtregel uitvoeren als één opdracht:
ru_ru: Передача в командную строку SSH единственным аргументом:

source: Debug:
fr: Débogage :
nl: Foutopsporing:
ru_ru: Отладка:

source: Copyright © 2017-2025 Philippe Troin (<a href="https://github.com/F-i-f">F-i-f</a> on GitHub)
fr: Copyright © 2017-2025 Philippe Troin (<a href="https://github.com/F-i-f">F-i-f</a> sur GitHub)
nl: Copyright © 2017-2025 Philippe Troin (<a href="https://github.com/F-i-f">F-i-f</a> op GitHub)
ru_ru: Авторские права © 2017-2025 Philippe Troin (<a href="https://github.com/F-i-f">F-i-f</a> on GitHub)

source: Copyright © 2013 Bernd Schlapsi
ru_ru: Авторские права © 2013 Bernd Schlapsi

source: Choose Terminal Emulator
fr: Choisir un émulateur de terminal
nl: Kies een terminalemulator
ru_ru: Закрыть эмулятор терминала

source: Cancel
fr: Annuler
nl: Annuleren
ru_ru: Отмена

source: Select
fr: Choisir
nl: Kiezen
ru_ru: Выбор

source: Terminal application.
fr: Emulateur de terminal.
nl: Terminaltoepassing.
ru_ru: Приложение терминала.

source: The Terminal Application used to launch new SSH sessions with.
fr: L'émulateur de terminal avec lequel les nouvelles sessions SSH seront lancées.
nl: De terminaltoepassing die moet worden gebruikt om nieuwe ssh-sessies mee op te zetten.
ru_ru: Приложение терминала, с помощью которого запускаются новые сеансы SSH.

source: Terminal application arguments.
fr: Arguments de l'émulateur de terminal.
nl: Opdrachtregelopties voor de terminaltoepassing.
ru_ru: Аргументы приложению терминала.

source: The arguments passed to the Terminal Application. The command "ssh [-p <port>] [user@]<host>" is appended after the provided arguments.
fr: Les arguments passés à l'émulatuer de terminal. La commande "ssh [-p <port>] [user@]<host>" sera ajoutée après les arguments fournis.
nl: De opdrachtregelopties die moeten worden doorgegeven aan de terminaltoepassing. De opdracht ‘ssh [-p <poort>] [user@]<host>’ wordt automatisch toegevoegd aan het einde van de regel.
ru_ru: Аргументы передающиеся в приложение терминала. После приведенных аргументов добавляется команда "ssh [-p <порт>] [пользователь@]<хост>".

source: SSH command line is passed as a single argument.
fr: La ligne de commande ssh est passée en un unique argument.
nl: De ssh-opdrachtregel wordt uitgevoerd als één opdracht.
ru_ru: Командная строка SSH передается в качестве единственного аргумента.

source: Whether or not the "ssh [-p <port>] [user@]<host>" command line is appended as a single argument. If not, the command line will be broken up and passed as multiple arguments. Depends on the Terminal Emulator Application used.
fr: Si la ligne de commande "ssh [-p <port>] [user@]<host>" est passée en un unique argument. Sinon, la ligne de commande sera décomposée et passée dans de multiples arguments. Dépend de l'émulateur de terminal choisi.
nl: Of ‘ssh [-p <poort>] [user@]<host>’ al dan niet als één opdracht moet worden toegevoegd. Als dat niet het geval is, dan wordt de regel opgebroken in meerdere delen. Of dit werkt is afhankelijk van de gebruikte terminalemulator.
ru_ru: Будет ли командная строка "ssh [-p <порт>] [пользователь@]<хост>" добавлена в качестве единственного аргумента. Если нет, то командная строка будет разделена и передана в виде нескольких аргументов. Зависит от используемого приложения-эмулятора терминала.

source: Debugging.
fr: Débogage.
nl: Foutopsporing.
ru_ru: Отладка.

source: Enable debugging for the extension.
fr: Activer le mode débogage de l'extension.
nl: Schakel foutopsporing van deze uitbreiding in.
ru_ru: Включить отладку для приложения.
